In [8]:
import numpy as np

In [16]:
a = np.array([[1, 2, 3, 3, 1],[6, 8, 11, 10, 7]])
print(a)

[[ 1  2  3  3  1]
 [ 6  8 11 10  7]]

In [15]:
mean_a = a.mean(axis=0)
print(mean_a)

[3.5 5.  7.  6.5 4. ]

In [23]:
print(a)
print(mean_a)
a_centered = a - mean_a

[[ 1  2  3  3  1]
 [ 6  8 11 10  7]]
[3.5 5.  7.  6.5 4. ]

In [35]:
print(a_centered)
print(a[:1,:5])
print(a[1:2,:5])
print(a_centered[0,0])
print(a_centered[0,1])
print(a_centered[1,0])

[[-2.5 -3.  -4.  -3.5 -3. ]
 [ 2.5  3.   4.   3.5  3. ]]
[[1 2 3 3 1]]
[[ 6  8 11 10  7]]
-2.5
-3.0
2.5

In [37]:
a_centered_sp = a_centered[0,0] * a_centered[1,0] + a_centered[0,1] * a_centered[1,1] + a_centered[0,2] * a_centered[1,2] + a_centered[0,3] * a_centered[1,3] + a_centered[0,4] * a_centered[1,4]

In [39]:
print(a_centered_sp)

-52.5

In [41]:
a_centered_sp / 4

-13.125

In [48]:
import pandas as pd

In [57]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 
                        'author_name':['Тургенев', 'Чехов', 'Островский']}, 
                       columns=['author_id', 'author_name'])

authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [58]:
books = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 
                      'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
                      'price':[450, 300, 350, 500, 450, 370, 290]}, 
                     columns=['author_id', 'book_title', 'price'])

books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [60]:
authors_price = pd.merge(authors, books, on = 'author_id', how = 'outer')

authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [61]:
top5 = authors_price.nlargest(5, 'price')

top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [65]:
min_p = authors_price.groupby('author_name').agg({'price': 'min'}).rename(columns={'price':'min_price'})

max_p = authors_price.groupby('author_name').agg({'price': 'max'}).rename(columns={'price':'max_price'})

mean_p = authors_price.groupby('author_name').agg({'price': 'mean'}).rename(columns={'price':'mean_price'})

authors_stat=pd.concat([min_p, max_p, mean_p], axis = 1)

authors_stat

             min_price  max_price  mean_price
author_name
Островский       290.0      370.0  330.000000
Тургенев         300.0      450.0  366.666667
Чехов            450.0      500.0  475.000000

In [66]:
cover = pd.DataFrame({'cover':['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']}, columns=['cover'])

authors_price = pd.concat([authors_price, cover], axis = 1)

authors_price

,author_id,author_name,book_title,price,mean_price,cover,cover
0,1.0,Тургенев,Отцы и дети,450.0,NaN,твердая,твердая
1,1.0,Тургенев,Рудин,300.0,NaN,мягкая,мягкая
2,1.0,Тургенев,Дворянское гнездо,350.0,NaN,мягкая,мягкая
3,2.0,Чехов,Толстый и тонкий,500.0,NaN,твердая,твердая
4,2.0,Чехов,Дама с собачкой,450.0,NaN,твердая,твердая
5,3.0,Островский,Гроза,370.0,NaN,мягкая,мягкая
6,3.0,Островский,Таланты и поклонники,290.0,NaN,мягкая,мягкая
Островский,NaN,NaN,NaN,NaN,330.000000,NaN,NaN
Тургенев,NaN,NaN,NaN,NaN,366.666667,NaN,NaN
Чехов,NaN,NaN,NaN,NaN,475.000000,NaN,NaN

In [67]:
?pd.pivot_table

In [70]:
books_covers = pd.pivot_table(authors_price, values='price', index=['author_name'], columns=['cover'], aggfunc=np.sum, fill_value=0)

books_covers

ValueError: Grouper for 'cover' not 1-dimensional